SELECT * FROM GRPCOMMONS_TBL;

SELECT * FROM COMMONS_TBL;
SELECT * FROM STUDENTS_TBL;
SELECT * FROM SUBJECTS_TBL;
SELECT * FROM PROFESSORS_TBL;
SELECT * FROM STUDENTS_TIME_TBL;
SELECT * FROM SCORES_TBL;


--1. 학생리스트 출력
-- 학생아이디, 학생이름,  학생주소,  학생하과


--2. 교수리스트 출력
--교수아이디   교수이름   교수주소   소속학과


--3. 과목리스트
-- 등록년도   등록학기   해당학과   과목    학점


--4. 학 학과별 과목리스트
-- 학과아이디, 학과명,   해당과목아이디, 해당과목,  학점

--5. 학생별 신청과목 리스트
--학생아이디  학생이름  소속학과  신청과목아이디  신청과목  학점
--각 학생별 총신청 학점


--6. 교수별 강의 리스트
-- 교수아이디    교수명    소속학과    강의과목아이디    과목명


--7. 각 학과별 학생숫자
--학과명    학생수


--8. 각 학과별 교수숫자
--학과명    교수수


--9. 각 학과별 학생숫자 , 소속교수숫자
--학과명    학생수,   교수수


--10. 각 지역별 학생숫자 , 소속교수숫자,
--지역명    학생수,   교수수


--11. 가장많은 학점을 듣고 있는 학생을 찾아주세요
-- 여러명일수도 있어요


--12. 가장많은 강의 시간을 가지고 있는 교수를 찾아주세요


--13. 2018년 2월1일 부터 ~ 2월 28일까지 각 날짜별로 수강신청 현황을 보여주세요


--14. 가장 수강신청이 많은 날짜를 찾아주세요


--15. 가장 수강신청이 많은 과목 해당과목 교수님을 찾아주세요


--16. 학생이 한명도 없는 학과의 교수명단 리스트를 보여주세요


--17. 각 학과별 학생들의 시험성적 평균과 합계를 보여주세요


--18. 전체 학생 성적리스트 
     -- 소속학화  학생명  평균   총점  신청학점  순위 순으로 보여주세요


--19. 출제한 교수 별 시험결과
    -- 소속학과  교수명  평균    총점 
    
    
--20. 다음과 같은 룰로 학생들의 총 학점을 구해주세요
/*
    90점 이상                  :  A     -  4.5
    80점 이상 90점미만       :  B     -  3.5
    70점 이상 80점미만       :  C     -  2.5
    60점 이상 70점미만       :  D     -  1.5
    60점 미만                  :  F     -  1.0
    
    소속학과   학생명    총신청학점      총점    평균     학점     순위
*/


